/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wonyocho <wonyocho@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/07/30 19:15:06 by wonyocho          #+#    #+#             */
/*   Updated: 2024/08/02 15:53:10 by wonyocho         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// https://techdebt.tistory.com/33
// 1. 초기화
// 2. 구조체로 넘겨라
// 옵션 그냥 그대로 하면
// cd -n 옵션은 그냥 우리가 처리를 한다.
// 연결리스트에 담아서 넘겨서 맨 마지막 꺼로 실행
// 3. 시그널 처리
// 리디렉션
// 히어독이면 따로 할건지 정해야함.

#include "minishell.h"
#include "macro.h"

int	main(int argc, char **argv)
{
	if (argc >= 2)
	{
		printf("too many arguments!\n");
		exit(0);
	}
	
	// 1. 터미널설정 초기화
	// 2. 시그널 초기화
	minishell(); // 3. 미니쉘 실행부분

	return (0);
}
